Revit 2026 API

# ScheduleDefinitionSetSortGroupFields Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetSortGroupFields(
	IList<ScheduleSortGroupField> sortGroupFields
)
```
```vb
Public Sub SetSortGroupFields (
	sortGroupFields As IList(Of ScheduleSortGroupField)
)
```
```cpp
public:
void SetSortGroupFields(
	IList<ScheduleSortGroupField^>^ sortGroupFields
)
```
```fsharp
member SetSortGroupFields :
        sortGroupFields : IList<ScheduleSortGroupField> -> unit
```

#### Parameters

sortGroupFields IListScheduleSortGroupField

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace